app/views/shared/_sidebar.html.erb

<%
  articles = Article.visible.order(released_at: :desc).limit(5)
---
SELECT  "articles".* FROM "articles" WHERE (released_at <= '2020-11-16 01:51:18.324326') AND (expired_at > '2020-11-16 01:51:18.324326' OR expired_at IS NULL) ORDER BY "articles"."released_at" DESC LIMIT ?  [["LIMIT", 5]]

<%
  entries = Entry.readable_for(current_member)
  .order(posted_at: :desc).limit(5)
---
SELECT  "entries".* FROM "entries" WHERE (status <> 'draft' OR member_id = 1) ORDER BY "entries"."posted_at" DESC LIMIT ?  [["LIMIT", 5]]