app/controllers/books_controller.rb

SELECT  "books".* FROM "books" ORDER BY number LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM "books"
---
  def index
    @books = Book.order("number")
    .page(params[:page]).per(15)