app/controllers/entries_controller.rb

  def index
    if params[:member_id]
      @member = Member.find(params[:member_id])
      @entries = @member.entries
    else
      @entries = Entry.all
    end

    @entries = @entries.readable_for(current_member)
    .order(posted_at: :desc).page(params[:page]).per(3)
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "entries".* FROM "entries" WHERE "entries"."member_id" = ? AND (status <> 'draft' OR member_id = 1) ORDER BY "entries"."posted_at" DESC LIMIT ? OFFSET ?  [["member_id", 1], ["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "entries" WHERE "entries"."member_id" = ? AND (status <> 'draft' OR member_id = 1)  [["member_id", 1]]

  def show
    @entry = Entry.readable_for(current_member).find(params[:id])
---
SELECT  "entries".* FROM "entries" WHERE (status <> 'draft' OR member_id = 1) AND "entries"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

  def edit
    @entry = current_member.entries.find(params[:id])
---
SELECT  "entries".* FROM "entries" WHERE "entries"."member_id" = ? AND "entries"."id" = ? LIMIT ?  [["member_id", 1], ["id", 10], ["LIMIT", 1]]