app/controllers/entry_images_controller.rb

  before_action :login_required

  before_action do
    @entry = current_member.entries.find(params[:entry_id])
---
SELECT  "entries".* FROM "entries" WHERE "entries"."member_id" = ? AND "entries"."id" = ? LIMIT ?  [["member_id", 1], ["id", 10], ["LIMIT", 1]]

  def create
    @image = @entry.images.build(image_params)
    if @image.save
---
INSERT INTO "entry_images" ("entry_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["entry_id", 10], ["created_at", "2020-11-16 02:31:36.617057"], ["updated_at", "2020-11-16 02:31:36.617057"]]

  def update
    @image = @entry.images.find(params[:id])
    @image.assign_attributes(image_params)
    if @image.save
---
UPDATE "entry_images" SET "updated_at" = ? WHERE "entry_images"."id" = ?  [["updated_at", "2020-11-16 02:31:36.620213"], ["id", 1]]