app/controllers/members_controller.rb

SELECT  "members".* FROM "members" ORDER BY number LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM "members"
---
  def index
    @members = Member.order("number")
      .page(params[:page]).per(15)

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "members" SET "updated_at" = ? WHERE "members"."id" = ?  [["updated_at", "2020-11-16 01:51:30.548705"], ["id", 1]]
---
  def update
    @member = Member.find(params[:id])
    @member.assign_attributes(member_params)
    if @member.save