app/controllers/top_controller.rb

  def index
    @articles = Article.visible.order(released_at: :desc).limit(5)
---
SELECT  "articles".* FROM "articles" WHERE (released_at <= '2020-11-16 02:31:23.888858') AND (expired_at > '2020-11-16 02:31:23.888858' OR expired_at IS NULL) ORDER BY "articles"."released_at" DESC LIMIT ?  [["LIMIT", 5]]